app/views/users/show.html.slim

      - if current_user.following?(@user)
        = form_for(current_user.relationships.find_by(follow_id: @user.id), html: { method: :delete }) do |f|
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = $1 AND "relationships"."follow_id" = $2 LIMIT $3  [["user_id", 1], ["follow_id", 3], ["LIMIT", 1]]