app/views/words/index.html.slim

              | いいね &nbsp;
              = Like.where(word_id: word.id).count
          .text-right
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."word_id" = $1  [["word_id", 93]]