app/views/words/show.html.slim

SELECT COUNT(*) FROM "likes" WHERE "likes"."word_id" = $1  [["word_id", 93]]
---
      li.list-inline-item.mx-3
        = "いいね！ #{Like.where(word_id: @word.id).count}"

SELECT COUNT(*) FROM "likes" WHERE "likes"."word_id" = $1  [["word_id", 93]]
---
          - unless current_user.id == @word.user.id
            - if Like.where(word_id: @word.id).count > 0