app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "word_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["word_id", 93], ["created_at", "2019-09-13 06:06:39.444867"], ["updated_at", "2019-09-13 06:06:39.444867"]]
---
    def create
        @like = Like.new(user_id: current_user.id, word_id: @word_id)

        if @like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."word_id" = $2 LIMIT $3  [["user_id", 1], ["word_id", 93], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 4]]
---
    def destroy
        @like = Like.find_by(user_id: current_user.id, word_id: @word_id)
        @like.destroy