app/controllers/relationships_controller.rb

    def create
      @user = User.find(params[:relationship][:follow_id])
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = $1 AND "relationships"."follow_id" = $2 LIMIT $3  [["user_id", 1], ["follow_id", 3], ["LIMIT", 1]]