app/controllers/relationships_controller.rb

    def create
      following = current_user.relationships.build(follow_id: params[:user_id])
      user = User.find_by(id: params[:show_user_id])
      if following.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "relationships" ("user_id", "follow_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["follow_id", 3], ["created_at", "2019-09-14 01:53:25.391549"], ["updated_at", "2019-09-14 01:53:25.391549"]]

    def destroy
      following = current_user.relationships.find_by(follow_id: params[:user_id])
      user = User.find_by(id: params[:show_user_id])
      if following.destroy
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = $1 AND "relationships"."follow_id" = $2 LIMIT $3  [["user_id", 1], ["follow_id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "relationships" WHERE "relationships"."id" = $1  [["id", 1]]