app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1, "password_digest" = $2 WHERE "users"."id" = $3  [["updated_at", "2019-09-13 04:14:04.225836"], ["password_digest", "$2a$12$A58gFkE9fzMMZ4xeP7k6tu3OWlBLrv6Z0p6dYKOoLz7wvyIg/yLlW"], ["id", 1]]