app/controllers/words_controller.rb

SELECT "words".* FROM "words"
SELECT  DISTINCT "words".* FROM "words" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(count_column) FROM (SELECT  DISTINCT "words"."id" AS count_column FROM "words" LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    # @words = current_user.words.recent
    # @words = current_user.words <==>  Word.where(user_id: current_user.id)
    @q = Word.all.ransack(params[:q])
    @words = @q.result(distinct: true).page(params[:page])

SELECT  "words".* FROM "words" WHERE "words"."id" = $1 LIMIT $2  [["id", 93], ["LIMIT", 1]]
---
  def show
    @word = Word.find(params[:id])

INSERT INTO "words" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "add"], ["description", "add"], ["created_at", "2019-09-13 04:14:56.583348"], ["updated_at", "2019-09-13 04:14:56.583348"], ["user_id", 4]]
---
  def create
    @word = current_user.words.new(word_params)

    if @word.save

UPDATE "words" SET "name" = $1, "updated_at" = $2 WHERE "words"."id" = $3  [["name", "更新機能のテストを書く"], ["updated_at", "2019-09-12 05:34:56.468412"], ["id", 35]]
---
  def update
    if @word.update(word_params)

DELETE FROM "words" WHERE "words"."id" = $1  [["id", 5]]
---
  def destroy
    @word.destroy

SELECT  "words".* FROM "words" WHERE "words"."user_id" = $1 AND "words"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 8], ["LIMIT", 1]]
---
  def set_word
    @word = current_user.words.find(params[:id])