app/models/user.rb

INSERT INTO "relationships" ("user_id", "follow_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["follow_id", 3], ["created_at", "2019-09-14 01:53:25.391549"], ["updated_at", "2019-09-14 01:53:25.391549"]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = $1 AND "relationships"."follow_id" = $2 LIMIT $3  [["user_id", 1], ["follow_id", 3], ["LIMIT", 1]]
---
    def follow(other_user)
        unless self == other_user
          self.relationships.find_or_create_by(follow_id: other_user.id)

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = $1 AND "relationships"."follow_id" = $2 LIMIT $3  [["user_id", 1], ["follow_id", 3], ["LIMIT", 1]]
DELETE FROM "relationships" WHERE "relationships"."id" = $1  [["id", 1]]
---
    def unfollow(other_user)
      relationship = self.relationships.find_by(follow_id: other_user.id)
      relationship.destroy if relationship

SELECT  1 AS one FROM "users" INNER JOIN "relationships" ON "users"."id" = "relationships"."follow_id" WHERE "relationships"."user_id" = $1 AND "users"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
---
    def following?(other_user)
      self.followings.include?(other_user)